tutorials/myLusgsFoam/transonicChannel.aungier.20MPa/system/MachNoRG
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2206
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the Mach Number field from the velocity field.

\*---------------------------------------------------------------------------*/

type            MachNoRG;
libs            (myfieldFunctionObjects);

field           U;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
